app/Controllers/Product.php

		  	  ];
          //Create new flash data session
		  	  $this->Session->setFlashdata('success', 'New Product Success to add');
		  	  $this->Product->insert($data);
---
INSERT INTO `product` (`name`, `slug`, `thumbnail`, `description`, `create_time`, `update_time`) VALUES ('buku kulamah', 'buku-kulamah', '1645098783_30407a934b565a3566d6.jpg', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod\r\ntempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,\r\nquis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo\r\nconsequat. Duis aute irure dolor in reprehenderit in voluptate velit esse\r\ncillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non\r\nproident, sunt in culpa qui officia deserunt mollit anim id est laborum.', '2022-02-17 05:53:03', '2022-02-17 05:53:03')

          'update_time' => $time,
          ];
          //Update data product by id product
          $this->Product->update($idproduct, $data);
---
UPDATE `product` SET `name` = 'jeany kumala dewi y', `slug` = 'jeany-kumaa-dewi', `thumbnail` = '1645094425_2d566a7761a383b33a3a.png', `description` = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod\r\ntempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,\r\nquis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo\r\nconsequat. Duis aute irure dolor in reprehenderit in voluptate velit esse\r\ncillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non\r\nproident, sunt in culpa qui officia deserunt mollit anim id est laborum.', `update_time` = '2022-02-17 05:43:25'
WHERE `product`.`id` IN ('2')