app/Models/ProductModel.php

  public function listing($limit = null){
    /*
    *List Product
    *$limit is a number
    */
     $page       = isset($_GET['page'])?(int)$_GET['page'] : 1;
     $first_page = ($page>1) ? ($page * $limit) - $limit : 0;
     $this->select('*');
    if ($limit === null) {
      $this->limit($limit);
	    $this->OFFSET($first_page);
    }
    $this->ORDERBY('id', 'DESC');
		$query = $this->get()->getResultArray();
---
SELECT *
FROM `product`
ORDER BY `id` DESC

  public function get_total_all(){
    /*
    *Count all data by id
    */
    $this->select('id, COUNT(id) as total');
    $this->ORDERBY('id');
    $query = $this->get()->getRowArray();
---
SELECT `id`, COUNT(id) as total
FROM `product`
ORDER BY `id`